src/cf/InformationRegisters/fmRouteStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmRouteStates</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>PointState</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutePointsStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.fmAgreeDocumentTypes</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Version</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AgreementRoute</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmAgreementRoutes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoutePoint</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/fmResponsiblesReplacements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmResponsiblesReplacements</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ResponsibleReplacing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BeginDate</Name>
					<Comment>Дата начала действия замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EndDate</Name>
					<Comment>Дата окончания действия замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/fmDepartments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmDepartments</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DepartmentType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetColor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructureVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentsStructuresVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManageType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmManagementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/fmRoutesPoints.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmRoutesPoints</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.fmAgreementRoutes</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccessTypeToRoutePoint</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmAccessTypeToRoutePoint</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DepartmentLevel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AgreementState</Name>
					<Comment>Состояние согласования, устанавливаемое по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutePointsStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviationState</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmRoutePointsStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManageType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmManagementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PointsPredecessors</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoutePoint</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmRoutesPoints</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/fmRouteStates/Forms/RecordForm/Ext/Form/Module.bsl
&AtServer
// Процедура установки доступности формы
//
Procedure SetFormAvailability()
	// Если состояние точки указано, то редактировать может только последнее звено.
	If EditAllowed Then
		If ValueIsFilled(Record.PointState) Then
			ReadOnly = True;
		ElsIf Parameters.AheadAgreement Then
			ReadOnly = True;
		Else
			ReadOnly = False;
		EndIf;
	Else	
		ReadOnly = True;
	EndIf;	
EndProcedure // УстановитьДоступностьФормы()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&AtServer
// Процедура обработчик "ПередЗаписьюНаСервере" 
//
Procedure BeforeWriteAtServer(Cancel, CurrentObject, RecordParameters)
	
	// При досрочном согласовании можно только утвердить.
	If Parameters.AheadAgreement AND Record.PointState.StageCompleted <> 1 Then
		CommonClientServer.MessageToUser("Допустимо только досрочное согласование документа!", , , ,Cancel);
	EndIf;
	
	// Проверим указание состояния для точки маршрута.
	If NOT ValueIsFilled(Record.PointState) Then
		CommonClientServer.MessageToUser("Не заполнено состояние точки!", , , ,Cancel);
	EndIf;
	
	// Проверим, а есть ли в БД такая точка.
	If NOT Parameters.AheadAgreement Then
		QueryCheck = New Query(
		"SELECT
		|	PassingRouteStates.PointState
		|FROM
		|	InformationRegister.fmRouteStates AS PassingRouteStates
		|WHERE
		|	PassingRouteStates.Document = &Document
		|	AND PassingRouteStates.AgreementRoute = &AgreementRoute
		|	AND PassingRouteStates.RoutePoint = &RoutePoint
		|	AND PassingRouteStates.Period = &Period");
		QueryCheck.SetParameter("Document", Record.Document);
		QueryCheck.SetParameter("RouteModel", Record.AgreementRoute);
		QueryCheck.SetParameter("RoutePoint", Record.RoutePoint);
		QueryCheck.SetParameter("Period", InitialPeriod);
		Result = QueryCheck.Execute().SELECT();
		If NOT Result.Next() Then
			CommonClientServer.MessageToUser("Данная точка маршрута была удалена при возврате или досрочном согласовании!", , , ,Cancel);
			Return;
		EndIf;
	EndIf;
	
	// Установим дату изменения состояния точки.
	CurrentObject.Period = CurrentSessionDate();
	
EndProcedure

&AtServer
// Процедура обработчик "ПриСозданииНаСервере" 
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Определим некоторые параметры при открытии формы.
	CurUser = SessionParameters.CurrentUser;
	InitialPeriod = Record.Period;
	
	If NOT ValueIsFilled(Record.Document) Then
		CommonClientServer.MessageToUser("Интерактивное добавление запрещено!", Cancel);
		Return;
	EndIf;
	
	QueryPointParameters = New Query(
	"SELECT ALLOWED
	|	RoutesPoints.Ref AS RoutePoint,
	|	RoutesPoints.AccessTypeToRoutePoint AS AccessType,
	|	RoutesPoints.DepartmentLevel,
	|	RoutesPoints.User,
	|	RoutesPoints.Department,
	|	RoutesPoints.ManageType,
	|	Value(Catalog.fmDepartments.EmptyRef) AS DocumentDepartment
	|FROM
	|	Catalog.fmRoutesPoints AS RoutesPoints
	|WHERE
	|	RoutesPoints.Ref = &RoutePoint
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|	fmResponsiblesReplacements.Responsible
	|FROM
	|	InformationRegister.fmResponsiblesReplacements AS fmResponsiblesReplacements
	|WHERE
	|	fmResponsiblesReplacements.ResponsibleReplacing = &CurUser
	|	AND (fmResponsiblesReplacements.BeginDate <= &CurrentDate
	|			OR fmResponsiblesReplacements.BeginDate = DATETIME(1, 1, 1, 0, 0, 0))
	|	AND (fmResponsiblesReplacements.EndDate >= &CurrentDate
	|			OR fmResponsiblesReplacements.EndDate = DATETIME(1, 1, 1, 0, 0, 0))");
	
	QueryPointParameters.SetParameter("Document", Record.Document);
	QueryPointParameters.SetParameter("RoutePoint", Record.RoutePoint);
	QueryPointParameters.SetParameter("CurUser", CurUser);
	QueryPointParameters.SetParameter("CurrentDate", BegOfDay(CurrentDate()));
	ResultBatch = QueryPointParameters.ExecuteBatch();
	PointParameters = ResultBatch[0].Unload();
	PointParameters[0].DocumentDepartment = Record.Department;
	ReplacingList = ResultBatch[1].Unload().UnloadColumn("Responsible");
	
	EditAllowed = NOT fmProcessManagement.DenyPointProcessing(PointParameters[0], CurUser, ReplacingList, CurrentSessionDate());
	FinalStage = fmProcessManagement.FinalStage(Record.RoutePoint);
	
	SetFormAvailability();
	
EndProcedure

&AtServer
// Процедура обработчик "ПослеЗаписиНаСервере" 
//
Procedure AfterWriteAtServer(CurrentObject, RecordParameters)
	SetFormAvailability();
EndProcedure
